In [1]:
# import libraries
import pandas as pd
from sqlalchemy import create_engine
import psycopg2

---
## Cost of Living Data

In [2]:
# retrieve data
url = 'https://www.numbeo.com/cost-of-living/rankings.jsp'

response = pd.read_html(url)

In [3]:
# cost of living df
living_cost_df = response[-1]
living_cost_df.head()

,Rank,City,Cost of Living Index,Rent Index,Cost of Living Plus Rent Index,Groceries Index,Restaurant Price Index,Local Purchasing Power Index
0,NaN,"Zurich, Switzerland",131.49,64.37,98.80,131.23,120.39,121.12
1,NaN,"Lugano, Switzerland",130.75,40.20,86.66,134.80,115.19,101.15
2,NaN,"Basel, Switzerland",130.65,46.61,89.72,126.05,131.92,109.90
3,NaN,"Geneva, Switzerland",126.08,66.56,97.10,123.84,119.47,108.09
4,NaN,"Lausanne, Switzerland",125.03,51.99,89.46,125.56,118.13,110.86

In [4]:
# clean data
living_cost_df.drop('Rank', axis=1, inplace=True)
living_cost_df.head()

,City,Cost of Living Index,Rent Index,Cost of Living Plus Rent Index,Groceries Index,Restaurant Price Index,Local Purchasing Power Index
0,"Zurich, Switzerland",131.49,64.37,98.80,131.23,120.39,121.12
1,"Lugano, Switzerland",130.75,40.20,86.66,134.80,115.19,101.15
2,"Basel, Switzerland",130.65,46.61,89.72,126.05,131.92,109.90
3,"Geneva, Switzerland",126.08,66.56,97.10,123.84,119.47,108.09
4,"Lausanne, Switzerland",125.03,51.99,89.46,125.56,118.13,110.86

In [5]:
#rename columns
living_cost_df.rename(columns={
    "Cost of Living Index": 'Cost_of_Living_Index',
    "Rent Index": 'Rent_Index',
    "Cost of Living Plus Rent Index": "Living_Cost",
    "Groceries Index": "Groceries_Index",
    "Restaurant Price Index": "Restaurant_Price_Index",
    "Local Purchasing Power Index": "Purchasing_Power_Index"
}, inplace=True)

In [6]:
living_cost_df.head()

,City,Cost_of_Living_Index,Rent_Index,Living_Cost,Groceries_Index,Restaurant_Price_Index,Purchasing_Power_Index
0,"Zurich, Switzerland",131.49,64.37,98.80,131.23,120.39,121.12
1,"Lugano, Switzerland",130.75,40.20,86.66,134.80,115.19,101.15
2,"Basel, Switzerland",130.65,46.61,89.72,126.05,131.92,109.90
3,"Geneva, Switzerland",126.08,66.56,97.10,123.84,119.47,108.09
4,"Lausanne, Switzerland",125.03,51.99,89.46,125.56,118.13,110.86

---
## Detailed Breakdown Data

In [7]:
#retrieve data from html
path = "https://www.numbeo.com/cost-of-living/prices_by_city.jsp?displayCurrency=USD&itemId=101&itemId=100&itemId=228&itemId=224&itemId=60&itemId=66&itemId=64&itemId=62&itemId=110&itemId=118&itemId=121&itemId=14&itemId=19&itemId=17&itemId=15&itemId=11&itemId=16&itemId=113&itemId=9&itemId=12&itemId=8&itemId=119&itemId=111&itemId=112&itemId=115&itemId=116&itemId=13&itemId=27&itemId=26&itemId=29&itemId=28&itemId=114&itemId=6&itemId=4&itemId=5&itemId=3&itemId=2&itemId=1&itemId=7&itemId=105&itemId=106&itemId=44&itemId=40&itemId=42&itemId=24&itemId=20&itemId=18&itemId=109&itemId=108&itemId=107&itemId=206&itemId=25&itemId=32&itemId=30&itemId=33"
response = pd.read_html(path)

In [8]:
# grabbing data frame from response object
breakdown_df = response[-1]
breakdown_df.head()

,Rank,City,"Meal, Inexpensive Restaurant","Meal for 2 People, Mid-range Restaurant, Three-course",McMeal at McDonalds (or Equivalent Combo Meal),Domestic Beer (0.5 liter draught),Imported Beer (0.33 liter bottle),Coke/Pepsi (0.33 liter bottle),Water (0.33 liter bottle),"Milk (regular), (1 liter)",...,Lettuce (1 head),Cappuccino (regular),"Rice (white), (1kg)",Tomato (1kg),Banana (1kg),Onion (1kg),Beef Round (1kg) (or Equivalent Back Leg Red Meat),Toyota Corolla Sedan 1.6l 97kW Comfort (Or Equivalent New Car),"Preschool (or Kindergarten), Full Day, Private, Monthly for 1 Child","International Primary School, Yearly for 1 Child"
0,NaN,"Saint Petersburg, Russia",6.30,25.20,3.78,2.27,2.52,0.70,0.49,0.81,...,0.80,1.76,1.00,1.84,0.80,0.42,6.03,17311.51,359.58,5679.08
1,NaN,"Samara, Russia",6.30,25.20,2.99,1.26,1.70,0.57,0.32,0.80,...,0.56,1.46,0.80,1.67,0.85,0.40,4.96,17158.80,137.13,4636.40
2,NaN,"Algiers, Algeria",3.30,15.53,3.88,1.75,1.94,0.53,0.19,0.71,...,0.48,0.83,0.89,0.68,1.86,0.40,11.80,22744.03,84.19,3501.29
3,NaN,"Milan, Italy",17.52,81.74,9.34,5.84,5.84,2.95,1.46,1.46,...,1.32,1.85,2.91,2.95,2.28,1.69,21.20,28829.68,748.42,14253.41
4,NaN,"Cairo, Egypt",5.11,28.73,5.59,2.23,3.19,0.35,0.21,0.97,...,0.33,2.06,0.74,0.39,0.85,0.38,8.74,23797.15,148.81,3704.18

In [9]:
# clean data
breakdown_df.drop('Rank', axis=1, inplace=True)

In [10]:
breakdown_df.head()

,City,"Meal, Inexpensive Restaurant","Meal for 2 People, Mid-range Restaurant, Three-course",McMeal at McDonalds (or Equivalent Combo Meal),Domestic Beer (0.5 liter draught),Imported Beer (0.33 liter bottle),Coke/Pepsi (0.33 liter bottle),Water (0.33 liter bottle),"Milk (regular), (1 liter)",Loaf of Fresh White Bread (500g),...,Lettuce (1 head),Cappuccino (regular),"Rice (white), (1kg)",Tomato (1kg),Banana (1kg),Onion (1kg),Beef Round (1kg) (or Equivalent Back Leg Red Meat),Toyota Corolla Sedan 1.6l 97kW Comfort (Or Equivalent New Car),"Preschool (or Kindergarten), Full Day, Private, Monthly for 1 Child","International Primary School, Yearly for 1 Child"
0,"Saint Petersburg, Russia",6.30,25.20,3.78,2.27,2.52,0.70,0.49,0.81,0.63,...,0.80,1.76,1.00,1.84,0.80,0.42,6.03,17311.51,359.58,5679.08
1,"Samara, Russia",6.30,25.20,2.99,1.26,1.70,0.57,0.32,0.80,0.39,...,0.56,1.46,0.80,1.67,0.85,0.40,4.96,17158.80,137.13,4636.40
2,"Algiers, Algeria",3.30,15.53,3.88,1.75,1.94,0.53,0.19,0.71,0.13,...,0.48,0.83,0.89,0.68,1.86,0.40,11.80,22744.03,84.19,3501.29
3,"Milan, Italy",17.52,81.74,9.34,5.84,5.84,2.95,1.46,1.46,2.14,...,1.32,1.85,2.91,2.95,2.28,1.69,21.20,28829.68,748.42,14253.41
4,"Cairo, Egypt",5.11,28.73,5.59,2.23,3.19,0.35,0.21,0.97,0.67,...,0.33,2.06,0.74,0.39,0.85,0.38,8.74,23797.15,148.81,3704.18

In [11]:
# view list of columns
list(breakdown_df.columns)

['City',
 'Meal, Inexpensive Restaurant',
 'Meal for 2 People, Mid-range Restaurant, Three-course',
 'McMeal at McDonalds (or Equivalent Combo Meal)',
 'Domestic Beer (0.5 liter draught)',
 'Imported Beer (0.33 liter bottle)',
 'Coke/Pepsi (0.33 liter bottle)',
 'Water (0.33 liter bottle)',
 'Milk (regular), (1 liter)',
 'Loaf of Fresh White Bread (500g)',
 'Eggs (regular) (12)',
 'Local Cheese (1kg)',
 'Water (1.5 liter bottle)',
 'Bottle of Wine (Mid-Range)',
 'Domestic Beer (0.5 liter bottle)',
 'Imported Beer (0.33 liter bottle).1',
 'Cigarettes 20 Pack (Marlboro)',
 'One-way Ticket (Local Transport)',
 'Chicken Fillets (1kg)',
 'Monthly Pass (Regular Price)',
 'Gasoline (1 liter)',
 'Volkswagen Golf 1.4 90 KW Trendline (Or Equivalent New Car)',
 'Apartment (1 bedroom) in City Centre',
 'Apartment (1 bedroom) Outside of Centre',
 'Apartment (3 bedrooms) in City Centre',
 'Apartment (3 bedrooms) Outside of Centre',
 'Basic (Electricity, Heating, Cooling, Water, Garbage) for 85m2 Apartment',
 '1 min. of Prepaid Mobile Tariff Local (No Discounts or Plans)',
 'Internet (60 Mbps or More, Unlimited Data, Cable/ADSL)',
 'Fitness Club, Monthly Fee for 1 Adult',
 'Tennis Court Rent (1 Hour on Weekend)',
 'Cinema, International Release, 1 Seat',
 '1 Pair of Jeans (Levis 501 Or Similar)',
 '1 Summer Dress in a Chain Store (Zara, H&M, ...)',
 '1 Pair of Nike Running Shoes (Mid-Range)',
 '1 Pair of Men Leather Business Shoes',
 'Price per Square Meter to Buy Apartment in City Centre',
 'Price per Square Meter to Buy Apartment Outside of Centre',
 'Average Monthly Net Salary (After Tax)',
 'Mortgage Interest Rate in Percentages (%), Yearly, for 20 Years Fixed-Rate',
 'Taxi Start (Normal Tariff)',
 'Taxi 1km (Normal Tariff)',
 'Taxi 1hour Waiting (Normal Tariff)',
 'Apples (1kg)',
 'Oranges (1kg)',
 'Potato (1kg)',
 'Lettuce (1 head)',
 'Cappuccino (regular)',
 'Rice (white), (1kg)',
 'Tomato (1kg)',
 'Banana (1kg)',
 'Onion (1kg)',
 'Beef Round (1kg) (or Equivalent Back Leg Red Meat)',
 'Toyota Corolla Sedan 1.6l 97kW Comfort (Or Equivalent New Car)',
 'Preschool (or Kindergarten), Full Day, Private, Monthly for 1 Child',
 'International Primary School, Yearly for 1 Child']

In [12]:
# only grab the columns we need and store in variable
clean_df = breakdown_df[['City',
 'Meal, Inexpensive Restaurant',
 'Meal for 2 People, Mid-range Restaurant, Three-course',
 'Water (1.5 liter bottle)',
 'Bottle of Wine (Mid-Range)',
 'Cigarettes 20 Pack (Marlboro)',
 'One-way Ticket (Local Transport)',
 'Monthly Pass (Regular Price)',
 'Gasoline (1 liter)',
 'Apartment (1 bedroom) in City Centre',
 'Apartment (3 bedrooms) in City Centre',
 'Basic (Electricity, Heating, Cooling, Water, Garbage) for 85m2 Apartment',
 'Internet (60 Mbps or More, Unlimited Data, Cable/ADSL)',
 'Fitness Club, Monthly Fee for 1 Adult',
 'Average Monthly Net Salary (After Tax)',
 'Mortgage Interest Rate in Percentages (%), Yearly, for 20 Years Fixed-Rate',
 'Preschool (or Kindergarten), Full Day, Private, Monthly for 1 Child',
 'International Primary School, Yearly for 1 Child']].copy()

In [13]:
breakdown_df.head()

,City,"Meal, Inexpensive Restaurant","Meal for 2 People, Mid-range Restaurant, Three-course",McMeal at McDonalds (or Equivalent Combo Meal),Domestic Beer (0.5 liter draught),Imported Beer (0.33 liter bottle),Coke/Pepsi (0.33 liter bottle),Water (0.33 liter bottle),"Milk (regular), (1 liter)",Loaf of Fresh White Bread (500g),...,Lettuce (1 head),Cappuccino (regular),"Rice (white), (1kg)",Tomato (1kg),Banana (1kg),Onion (1kg),Beef Round (1kg) (or Equivalent Back Leg Red Meat),Toyota Corolla Sedan 1.6l 97kW Comfort (Or Equivalent New Car),"Preschool (or Kindergarten), Full Day, Private, Monthly for 1 Child","International Primary School, Yearly for 1 Child"
0,"Saint Petersburg, Russia",6.30,25.20,3.78,2.27,2.52,0.70,0.49,0.81,0.63,...,0.80,1.76,1.00,1.84,0.80,0.42,6.03,17311.51,359.58,5679.08
1,"Samara, Russia",6.30,25.20,2.99,1.26,1.70,0.57,0.32,0.80,0.39,...,0.56,1.46,0.80,1.67,0.85,0.40,4.96,17158.80,137.13,4636.40
2,"Algiers, Algeria",3.30,15.53,3.88,1.75,1.94,0.53,0.19,0.71,0.13,...,0.48,0.83,0.89,0.68,1.86,0.40,11.80,22744.03,84.19,3501.29
3,"Milan, Italy",17.52,81.74,9.34,5.84,5.84,2.95,1.46,1.46,2.14,...,1.32,1.85,2.91,2.95,2.28,1.69,21.20,28829.68,748.42,14253.41
4,"Cairo, Egypt",5.11,28.73,5.59,2.23,3.19,0.35,0.21,0.97,0.67,...,0.33,2.06,0.74,0.39,0.85,0.38,8.74,23797.15,148.81,3704.18

In [14]:
#. rename columns
clean_df.rename(columns={
    'Meal, Inexpensive Restaurant': 'Meal_for_1',
    'Meal for 2 People, Mid-range Restaurant, Three-course': 'Meal_for_2',
    'Bottle of Wine (Mid-Range)': 'Bottle_of_Wine',
    'Cigarettes 20 Pack (Marlboro)': 'Cigarettes_20_pack',
    'Monthly Pass (Regular Price)': 'Monthly_Pass',
    'Apartment (1 bedroom) in City Centre': 'Apartment_1_bedroom',
    'Apartment (3 bedrooms) in City Centre': 'Apartment_3_bedroom',
    'Basic (Electricity, Heating, Cooling, Water, Garbage) for 85m2 Apartment':'Utilities',
    'Internet (60 Mbps or More, Unlimited Data, Cable/ADSL)': 'Internet_Services',
    'Fitness Club, Monthly Fee for 1 Adult': 'Gym_membership',
    'Average Monthly Net Salary (After Tax)': 'Average_Monthly_Net_Salary',
    'Mortgage Interest Rate in Percentages (%), Yearly, for 20 Years Fixed-Rate': 'Mortgage_Interest_Rate',
    'Preschool (or Kindergarten), Full Day, Private, Monthly for 1 Child': 'Pre_School_Tuition',
    'International Primary School, Yearly for 1 Child':'Primary_School_Tuition',
    'Water (1.5 liter bottle)': 'Bottle_of_Water',
    'One-way Ticket (Local Transport)': 'One_Way_Ticket',
    'Gasoline (1 liter)': 'Liter_of_Gasoline'
}, inplace=True)

In [15]:
clean_df.head()

,City,Meal_for_1,Meal_for_2,Bottle_of_Water,Bottle_of_Wine,Cigarettes_20_pack,One_Way_Ticket,Monthly_Pass,Liter_of_Gasoline,Apartment_1_bedroom,Apartment_3_bedroom,Utilities,Internet_Services,Gym_membership,Average_Monthly_Net_Salary,Mortgage_Interest_Rate,Pre_School_Tuition,Primary_School_Tuition
0,"Saint Petersburg, Russia",6.30,25.20,0.53,6.30,2.02,0.63,37.80,0.59,464.46,939.88,99.00,6.37,26.61,583.66,9.59,359.58,5679.08
1,"Samara, Russia",6.30,25.20,0.42,5.04,1.57,0.38,22.68,0.57,265.67,515.77,87.71,6.53,21.91,355.40,10.47,137.13,4636.40
2,"Algiers, Algeria",3.30,15.53,0.24,6.99,2.10,0.31,11.65,0.31,262.70,469.99,37.88,37.36,22.30,289.36,6.66,84.19,3501.29
3,"Milan, Italy",17.52,81.74,0.50,7.01,6.66,2.34,45.54,1.84,1255.51,2964.14,186.19,33.44,70.15,1941.98,1.91,748.42,14253.41
4,"Cairo, Egypt",5.11,28.73,0.32,9.58,2.78,0.32,12.77,0.49,244.10,505.58,35.04,16.16,30.43,271.32,12.88,148.81,3704.18

In [16]:
# create new table to compare the price values to NYC by dividing and coming up with a ratio.
compare_nyc_df = clean_df.set_index("City")
nyc_value = compare_nyc_df.loc["New York, NY, United States", :].to_list()
compare_nyc_df = compare_nyc_df / nyc_value

In [17]:
compare_nyc_df.head()

,Meal_for_1,Meal_for_2,Bottle_of_Water,Bottle_of_Wine,Cigarettes_20_pack,One_Way_Ticket,Monthly_Pass,Liter_of_Gasoline,Apartment_1_bedroom,Apartment_3_bedroom,Utilities,Internet_Services,Gym_membership,Average_Monthly_Net_Salary,Mortgage_Interest_Rate,Pre_School_Tuition,Primary_School_Tuition
City,,,,,,,,,,,,,,,,,
"Saint Petersburg, Russia",0.293023,0.2520,0.253589,0.420000,0.134667,0.229091,0.297638,0.808219,0.138619,0.140430,0.692453,0.099345,0.315396,0.100530,2.471649,0.148392,0.144910
"Samara, Russia",0.293023,0.2520,0.200957,0.336000,0.104667,0.138182,0.178583,0.780822,0.079290,0.077062,0.613485,0.101840,0.259689,0.061214,2.698454,0.056591,0.118304
"Algiers, Algeria",0.153488,0.1553,0.114833,0.466000,0.140000,0.112727,0.091732,0.424658,0.078403,0.070222,0.264951,0.582658,0.264312,0.049839,1.716495,0.034744,0.089340
"Milan, Italy",0.814884,0.8174,0.239234,0.467333,0.444000,0.850909,0.358583,2.520548,0.374710,0.442879,1.302301,0.521522,0.831457,0.334487,0.492268,0.308860,0.363696
"Cairo, Egypt",0.237674,0.2873,0.153110,0.638667,0.185333,0.116364,0.100551,0.671233,0.072852,0.075540,0.245086,0.252027,0.360673,0.046732,3.319588,0.061411,0.094517

---
## Add Database

In [ ]:
# create engine variable
engine = create_engine('postgresql://postgres:PASSWORD@localhost:5432/cost_of_living')
conn = engine.connect()

In [ ]:
# check current tables
engine.table_names()

In [ ]:
# create table for living_cost_index
living_cost_df.to_sql(name="living_cost_index", con=engine, index=False)

In [ ]:
# create table for detailed breakdown
clean_df.to_sql(name="detailed_breakdown", con=engine, index=False)

In [ ]:
# create table for living_cost_compare_to_nyc
compare_nyc_df.to_sql(name="living_cost_compare_to_nyc", con=engine, index=True)